CFDEMcoupling-PUBLIC-5.x/tutorials/twoSpheresGlowinskiMPI_twoPhase/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (water air);

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 2e-4; 
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

air  
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.0e-5; 
    rho             rho [ 1 -3 0 0 0 0 0 ] 1;  
}    



sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.072;
}
// ************************************************************************* //
