CFDEMcoupling-PUBLIC-5.x/tutorials/twoSpheresGlowinskiMPI_twoPhase/CFD/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dimensions      [0 2 -2 0 0 0 0];
dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0; //100000;

boundaryField
{
    inlet      
    {
        type            zeroGradient;
    }

    wall      
    {
        type            zeroGradient;
    }

    outlet
    {
        //type            zeroGradient; //fixedValue;
	type 		fixedValue;
        value 		uniform 0;
    }

    //frontAndBack    
    //{
    //    type            empty;
    //}
}

// ************************************************************************* //
