CFDEMcoupling-PUBLIC-5.x/tutorials/twoSpheresGlowinskiMPI_twoPhase/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    pd
    {
	solver		PCG;
	preconditioner  
	{
	   preconditioner GAMG;
	   tolerance	1e-08;
	   relTol	0;
	   nVcycles	2;
	   smoother        GaussSeidel;
	   nPreSweeps      0;
	   nPostSweeps     2;
	   nFinestSweeps   2;
	   cacheAgglomeration false;
	   nCellsInCoarsestLevel 10;
	   agglomerator    faceAreaPair;
	   mergeLevels     1;
	}
	tolerance	1e-08;
	relTol		0;
	maxIter		20;
    }

    pdFinal
    {
	solver		PCG;
	preconditioner  
	{
	   preconditioner GAMG;
	   tolerance	1e-08;
	   relTol	0;
	   nVcycles	2;
	   smoother        GaussSeidel;
	   nPreSweeps      0;
	   nPostSweeps     2;
	   nFinestSweeps   2;
	   cacheAgglomeration false;
	   nCellsInCoarsestLevel 10;
	   agglomerator    faceAreaPair;
	   mergeLevels     1;
	}
	tolerance	1e-08;
	relTol		0;
	maxIter		20;
    }

     "alpha.water.*"
    {
	interfaceMethod "isoAdvector";  // MULES !!
        isoFaceTol      1e-6;
        surfCellTol     1e-6;
        snapTol         1e-12;
        nAlphaBounds    3;
        clip            true;

        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    k
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    epsilon
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    R
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    nuTilda
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    phiIB
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       100000;
}

PIMPLE
{
    nOuterCorrectors 1;
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       100000;
    nAlphaCorr	    	1;
    nAlphaSubCycles 	1;
    cAlpha  		1;
}
relaxationFactors
{
    fields
    {
	    p	1.0;
    }
    equations
    {
        "U.*"           1.;
        "k.*"           1.;
        "epsilon.*"     1.;
    }
}


// ************************************************************************* //
