CFDEMcoupling-PUBLIC-5.x/tutorials/twoSpheresGlowinskiMPI_twoPhase/CFD/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0    //0 is working
);

regions
(

    boxToCell
    {    
	box (0 0 0)(1 1 2);
	        
	fieldValues
        (
            volScalarFieldValue alpha.water 1
        );

    }

);


// ************************************************************************* //
